#include <stdio.h>
 int main(){ 
    int a = 5, b =17 ;                                          // ประกาศตัวแปร int
    float c= 8.5 , d = 4.0 ;                                    // ประกาศตัวแปร float
    printf("ตัวแปรทั้งหมด a=%d b=%d c=%.1f d=%.1f\n",a,b,c,d);     // แสดงค่าตัวแปรทั้งหมด
    printf(" d + a = %.1f\n",d + a);                      // แสดงผลการคำนวณของ d + a = 9.0 
    printf(" a - b = %d\n",a - b);                        // แสดงผลการคำนวณของ a - b = -12
    printf(" c * d = %.1f\n",c * d);                      // แสดงผลการคำนวณของ c * d = 34.0 
    printf(" a * c = %.1f\n",a * c);                      // แสดงผลการคำนวณของ a * c = 42.5 
    printf(" c / d = %.2f\n",c / d);                      // แสดงผลการคำนวณของ c / d = 2.13 
    printf(" b / c = %.1f\n",b / c);                      // แสดงผลการคำนวณของ b / c = 2.0 
    printf(" a %% b = %d\n", a % b);                       // แสดงผลการคำนวณของ a % b = 5
    printf("(int)c %% a = %d\n", (int)c % a);             // แสดงผลการคำนวณของ c % a = 3
    printf("(int)c %% (int)d = %d\n", (int)c % (int)d);   // แสดงผลการคำนวณของ c % d = 0  
    return 0;                                             // คืนค่า 0 โปรแกรมทำงานเสร็จสิ้น
}                                                            
// ประกาศตัวแปร int  a = 5 , b = 17 ; 
// ประกาศตัวแปร float c = 8.5 , d = 4.0 ;  
// 1.แสดงค่าตัวแปรทั้งหมด a = 5 b = 17 c = 8.5 d = 4.0
// 2.แสดงผลการคำนวณของ ค่า 4.0 + 5 = 9.0
// 3.แสดงผลการคำนวณของ ค่า 5 - 17 = -12    
// 4.แสดงผลการคำนวณของ ค่า 8.5 * 4.0 = 34.0 
// 5.แสดงผลการคำนวณของ ค่า 5 * 8.5 = 42.5 
// 6.แสดงผลการคำนวณของ ค่า 8.5 / 4.0 = 2.13 
// 7.แสดงผลการคำนวณของ ค่า 17 / 8.5 = 2.0 
// 8.แสดงผลการคำนวณของ ค่า 5 % 17 = 5 ไม่ต้องแปลงค่าเพราะค่าทั้งสองเป็น int
// 9.แสดงผลการคำนวณของ ค่า 8 % 5 = 3 โดยต้องแปลง c แปลงค่าเป็น int แล้วจึงใช้ได้ เนื่องจากรับค่าเป็น float ทำให้ Error
// 10.แสดงผลการคำนวณของ ค่า 8 % 4 = 0 โดยต้องแปลงทั้ง c,d แปลงค่าเป็น int แล้วจึงใช้ได้ เนื่องจากรับค่าเป็น float ทำให้ Error