#include <stdio.h>

 int main() {

    printf("+-----------------------+----------+----------+----------+\n"); 
    double x = 1.0, y = 2.0, z;
    printf("|        นิพจน์           | x = %.2f | y = %.2f | z = %.2f |\n", x , y , z);        // แสดงค่าตัวแปรทั้งหมด
    printf("+-----------------------+----------+----------+----------+\n");                   // แสดงเส้นแบ่งตาราง
    x = y + 5.0;                                                                              // คำนวณค่า x = y + 5.0                             
    printf("| x = y + 5.0           |%10.2f|%10.2f|%10.2f|\n",x, y, z);                       // แสดงผลการคำนวณ
    printf("|-----------------------|----------|----------|----------|\n");                   // แสดงเส้นแบ่งตาราง
    y = x / 2.0;                                                                              // คำนวณค่า y = x / 2.0                               
    printf("| y = x / 2.0           |%10.2f|%10.2f|%10.2f|\n",x, y, z);                       // แสดงผลการคำนวณ 
    printf("|-----------------------|----------|----------|----------|\n");                   // แสดงเส้นแบ่งตาราง
    y = (x * 3.0) + 4.0;                                                                      // คำนวณค่า y = ( x * 3.0 ) + 4.0
    printf("| y = ( x * 3.0 ) + 4.0 |%10.2f|%10.2f|%10.2f|\n",x, y, z);                       // แสดงผลการคำนวณ
    printf("|-----------------------|----------|----------|----------|\n");                   // แสดงเส้นแบ่งตาราง        
    x = -0.5 - y;                                                                             // คำนวณค่า x = -5.0 - y                           
    printf("| x = -0.50  y          |%10.2f|%10.2f|%10.2f|\n",x, y, z);                       // แสดงผลการคำนวณ           
    printf("|-----------------------|----------|----------|----------|\n");                   // แสดงเส้นแบ่งตาราง                  
    z = x + y;                                                                                // คำนวณค่า z = x + y                          
    printf("| z = x + y             |%10.2f|%10.2f|%10.2f|\n",x, y, z);                       // แสดงผลการคำนวณ 
    printf("+-----------------------+----------+----------+----------+\n");                   // แสดงเส้นล่างสุดของตาราง 


    return 0;                                                                                 // คืนค่า 0 โปรแกรมทำงานเสร็จสิ้น
 }