#include <stdio.h>

int main(){
    
    printf("A=%d\n",-2+5*2);                        // คำนวณ -2 + 5 * 2 = 8
    printf("B=%d\n",10/2*3);                        // คำนวณ 10 / 2 * 3 = 15
    printf("C=%d\n",6/2+3*(4%2));                   // คำนวณ 6 / 2 + 3 * (4 % 2) = 3
    printf("D=%d\n",(5+2)*15%4);                    // คำนวณ (5 + 2) * 15 % 4 = 1
    printf("E=%d\n",6+2*2-6/2);                     // คำนวณ 6 + 2 * 2 - 6 / 2 = 7
    printf("F=%d\n",5+3*2-8/4+(6%5));               // คำนวณ 5 + 3 * 2 - 8 / 4 + (6 % 5) = 10
    printf("G=%d\n",(4+3)*2-10/(2+3));              // คำนวณ (4 + 3) * 2 - 10 / (2 + 3) = 12

    return 0;                                       // คืนค่า 0 โปรแกรมทำงานเสร็จสิ้น
}
